In [41]:
import pandas as pd
import numpy as np

In [44]:
data={
    "nombre":["Juan","camilo", "Jun", "Carlos","Pedro"],
    "edad":[22,44, np.nan, 32,76],
    "ciudad":['Bogotá','Cali','Medellin',"villavicencio",None]
}
df=pd.DataFrame(data)
df

   nombre  edad         ciudad
0    Juan  22.0         Bogotá
1  camilo  44.0           Cali
2     Jun   NaN       Medellin
3  Carlos  32.0  villavicencio
4   Pedro  76.0           None

In [46]:
df_fill=df.fillna(
    {
        "edad" : df["edad"].mean(),
        "ciudad": "Desconocido"
    }
)
df_fill

   nombre  edad         ciudad
0    Juan  22.0         Bogotá
1  camilo  44.0           Cali
2     Jun  43.5       Medellin
3  Carlos  32.0  villavicencio
4   Pedro  76.0    Desconocido

In [47]:
#interpolacion
df_interpolado=df.copy()
df_interpolado["edad"] =df["edad"].interpolate()
df_interpolado

   nombre  edad         ciudad
0    Juan  22.0         Bogotá
1  camilo  44.0           Cali
2     Jun  38.0       Medellin
3  Carlos  32.0  villavicencio
4   Pedro  76.0           None

In [2]:
#serie pandas

numeros =[3,2,3,4,5,6]
serie= pd.Series(numeros)
serie, type(serie)

(0    3
 1    2
 2    3
 3    4
 4    5
 5    6
 dtype: int64,
 pandas.core.series.Series)

In [22]:
data={
    "nombre":["Juan","camilo", "Jun", "Carlos","Pedro"],
    "edad":[22,43,44,32,76],
    "ciudad":['Bogotá','Cali','Medellin',"villavicencio",'ibague']

}
data, type(data)

({'nombre': ['Juan', 'camilo', 'Jun', 'Carlos', 'Pedro'],
  'edad': [22, 43, 44, 32, 76],
  'ciudad': ['Bogotá', 'Cali', 'Medellin', 'villavicencio', 'ibague']},
 dict)

In [23]:
df= pd.DataFrame(data=data)
df

   nombre  edad         ciudad
0    Juan    22         Bogotá
1  camilo    43           Cali
2     Jun    44       Medellin
3  Carlos    32  villavicencio
4   Pedro    76         ibague

In [25]:
#exportar dataframes

df.to_csv("data.csv")

In [26]:
#importar dataframe

import_df= pd.read_csv("data.csv", index_col=0)
import_df

   nombre  edad         ciudad
0    Juan    22         Bogotá
1  camilo    43           Cali
2     Jun    44       Medellin
3  Carlos    32  villavicencio
4   Pedro    76         ibague

In [18]:
#seleccionar varias columnas
df[["nombre","edad"]]

   nombre  edad
0    Juan    22
1  camilo    43
2     Jun    44
3  Carlos    32
4   Pedro    76

In [27]:
#filtrar por indice
fila= df.loc[2]
fila

nombre         Jun
edad            44
ciudad    Medellin
Name: 2, dtype: object

In [28]:
#filtrar por condicion
df[df["edad"]>43]

  nombre  edad    ciudad
2    Jun    44  Medellin
4  Pedro    76    ibague

In [36]:
filtro= (df["edad"]>23) & (df["nombre"].str.startswith("J"))
df[filtro]

  nombre  edad    ciudad
2    Jun    44  Medellin

In [38]:
def longitud_5(nombre):
    return len(nombre) == 3

df[df["nombre"].apply(longitud_5)]

  nombre  edad    ciudad
2    Jun    44  Medellin

In [39]:
#filtrar por edades entre 25 y 35 años
df[df["edad"].between(25,35)]

   nombre  edad         ciudad
3  Carlos    32  villavicencio

In [16]:
#seleccionar una columna
nombres= df["nombre"]
print(nombres)

0      Juan
1    camilo
2       Jun
3    Carlos
4     Pedro
Name: nombre, dtype: object